console.log("Текст из script.js!");


// 2 дз

// Задание 1
// Создать переменные num1, num2 которые пользователь вводит с клавиатуры
// Проверьте, что переменная num1 равна или меньше 1, а переменная num2 больше или равна 3.
let num1 = prompt("Введите num1");
let num2 = prompt("Введите num2");

if (num1 <= 1 && num2 >= 3) {
    console.log("Переменная num1 равна или меньше 1, а переменная num2 больше или равна 3");
} else {
    console.log("Переменная num1 больше 1, или переменная num2 меньше 3");
}

// Задание 2
// Перепишите код к тернарному оператору

// let test = true;
// if (test === true) {
// console.log('+++');
// } else {
// console.log('---');
// }

let test = true;
test === true ? console.log('+++') : console.log('---');

// Задание 3
// В переменной day лежит какое-то число из интервала от 1 до 31. Определите в какую декаду месяца попадает это число (в первую, вторую или третью).

let day = 15;

if (day <= 10) {
    console.log('Первая декада');
} else if (day <= 20) {
    console.log('Вторая декада');
} else {
    console.log('Третья декада');
}


// Задание 4
// Необязательное задание. (Если вам показалось домашнее задание простым, выполняем данный пункт)
// (Для решения задания вам потребуется оператор остаток от деления %, например 10%3 === 1 , десять разделить на 3, остаток 1, второй пример 7 % 5, тут остаток от деления будет 2, ну и 3 пример это 14 % 10 === 4, остаток от деления на 10 будет равен 4)

let number = +prompt("Введите число:");
let units = number % 10; // единицы
let tens = Math.floor(number / 10) % 10; // десятки
let hundreds = Math.floor(number / 100); // сотни
console.log(`В числе ${number} количество сотен: ${hundreds}, десятков: ${tens}, единиц: ${units}`);


