// console.log("Текст из script.js!");

// 4 ДЗ

// Задание 1
// Необходимо с помощью цикла for вывести следующие 11 строк в консоль:
// 0 – это ноль
// 1 – нечетное число
// 2 – четное число
// 3 – нечетное число
// …
// 10 – четное число

for (let i = 0; i <= 10; i++) {
    if (i === 0) {
      console.log(`${i} - это ноль`);
    } else if (i % 2 === 0) {
      console.log(`${i} - четное число`);
    } else {
      console.log(`${i} - нечетное число`);
    }
  }
  


// Задание 2
// Дан массив [1, 2, 3, 4, 5, 6, 7]
// Сделайте из этого массива следующий [1, 2, 3, 6, 7]

const arr = [1, 2, 3, 4, 5, 6, 7];
arr.splice(3, 2); // удаляем элементы начиная с индекса 3 (включительно) и до конца массива
console.log(arr); // [1, 2, 3, 6, 7]
  


// Задание 3
// Используя Math.random() вам необходимо генерировать цифры от 0 до 9, и создать массив состоящий из 5 таких элементов
// 1. Рассчитать сумму элементов этого массива
// 2. Найти минимальное число
// 3. Найти есть ли в этом массиве число 3


const arr = [];

// генерируем массив из 5 элементов со случайными числами от 0 до 9
for (let i = 0; i < 5; i++) {
  arr.push(Math.floor(Math.random() * 10));
}

// рассчитываем сумму элементов массива
const sum = arr.reduce((acc, cur) => acc + cur);

// находим минимальное число в массиве
const min = Math.min(...arr);

// проверяем, есть ли число 3 в массиве
const isThreeInArray = arr.includes(3);

console.log(arr);
console.log(`Сумма элементов: ${sum}`);
console.log(`Минимальное число: ${min}`);
console.log(`Число 3 в массиве: ${isThreeInArray}`);


// *Необязательное задание. *
// Необходимо вывести горку в консоль (используя цикл for), как показано на рисунке, только у вашей горки должно быть 20 рядов, а не 5:

// x
// xx
// xxx
// xxxx
// xxxxx


for (let i = 1; i <= 20; i++) {
    console.log("x".repeat(i));
  }
  